# -*- coding: utf-8 -*-
"""Application configuration.

Most configuration is set via environment variables.

For local development, use a .env file to set
environment variables.
"""
import json
import os.path
import logging

from environs import Env
from dotenv import load_dotenv

PROJECT_PATH = os.path.dirname(os.path.dirname(__file__))
# os.environ["APP_ENV"] = os.environ.get("APP_ENV", "DEV")  # Set app environ [DEV, PROD]

dotenv_path = os.path.join(PROJECT_PATH, "config", ".env", os.environ["APP_ENV"].lower())
logging.warning("Project current settings path: %s", dotenv_path)
load_dotenv(dotenv_path)

env = Env()
# env.read_env()

APP_ENV = env.str("APP_ENV", default="DEV")
DEBUG = APP_ENV == "DEV"

WTF_CSRF_ENABLED = False

SECRET_KEY = env.str("SECRET_KEY", default='fr3hhj&6k2b_s&cvk(=(!#wcotx1nkcgkp%0^%no2xg#xr9^n!')
SEND_FILE_MAX_AGE_DEFAULT = env.int("SEND_FILE_MAX_AGE_DEFAULT", default=None)
BCRYPT_LOG_ROUNDS = env.int("BCRYPT_LOG_ROUNDS", default=13)
# DEBUG_TB_ENABLED = DEBUG
DEBUG_TB_ENABLED = False
DEBUG_TB_INTERCEPT_REDIRECTS = False
CACHE_TYPE = (
    "flask_caching.backends.SimpleCache"  # Can be "MemcachedCache", "RedisCache", etc.
)

SQLALCHEMY_DATABASE_URI = env.str("DATABASE_URL")
SQLALCHEMY_TRACK_MODIFICATIONS = True
SQLALCHEMY_BINDS = {
    "workflow": env.str("WORKFLOW_DATABASE_URL"),
    "novel_crawler": env.str("CRAWLER_DATABASE_URL"),
}
SQLALCHEMY_ECHO = DEBUG

TIME_ZONE = None

# OpenAI Config
OPENAI_API_BASE = "http://oneapi.crotondata.cn/v1"
OPENAI_API_KEY = "sk-XpwEM1Np8oLFlEKB755445CcF06c422290F1D0D6A021977b"
OPENAI_MODEL = "gpt-4o"
OPENAI_PROXY = None
CHATGPT_RATE_LIMIT = 30
DALLE_RATE_LIMIT = 0
CONVERSATION_MAX_TOKENS = 100000
TEXT_TO_IMAGE = 'dall-e-3'
SESSION_EXPIRES_IN_SECONDS = 2 * 60 * 60

AZURE_API_VERSION = None
AZURE_DEPLOYMENT_ID = None
IMAGE_CREATE_SIZE = "256x256"

DEFAULT_OPENAI_SYSTEM_PROMPT = "你是基于大语言模型的AI智能助手，旨在回答并解决人们的任何问题，并且可以使用多种语言与人交流。"

# WorkTool Config
MAX_RETRY_TIMES = 3
WT_API_BASE = "https://api.worktool.ymdyes.cn"
WT_ROBOT_ID = env.str("WT_ROBOT_ID")
# WT_GROUP_NAMES = env.list("WT_GROUP_NAMES", subcast=str, delimiter=",")
WT_GROUP_MASTER = "小风机器人"
WT_ROBOT_DETECTION_RECEIVER = env.str("WT_ROBOT_DETECTION_RECEIVER")


MIDDLEWARES = [
    "wecom.core.middlewares.authentication.AuthTokenMiddleware"
]

EXEMPT_ENDPOINTS = [
    "wecom/health_check",
]


# 推送相关
PUSH_REBOT_GROUP_MAPPING = [
    # 北京创意发现中心
    {
        "name": "创意发现中心IP智能推荐群",
        "target_ai_score": 8.5,
        "matching_list": [
            # 都市大女主
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "都市情缘"]},

            # 都市职场
            {"晋江小说": ["现代言情", "业界精英"]},

            # 都市情感+话题
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "婚前婚后"]},
            {"晋江小说": ["现代言情", "时尚流行"]},

            # 悬疑惊悚+推理探案
            {"晋江小说": ["未来游戏悬疑", "悬疑惊悚"]},
            {"晋江小说": ["未来游戏悬疑", "未来科幻"]},
            {"晋江小说": ["未来游戏悬疑", "推理探案"]},
            {"晋江小说": ["未来游戏悬疑", "异度幻想"]},
            {"晋江小说": ["未来游戏悬疑", "末世异世"]},
        ]
    },

    # 宽厚团队
    {
        "name": "宽厚IP智能推荐群",
        "target_ai_score": 8.5,
        "matching_list": [
            # 古装大女主
            {"晋江小说": ["古代言情", "复仇虐渣"]},
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "市井人家"]},
            {"晋江小说": ["古代言情", "女尊女强"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},

            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},

            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "仙侠情缘"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},

            # 古装大男主
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},

            {"晋江小说": ["古代穿越", "宫廷侯爵"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},

            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},
            {"晋江小说": ["奇幻言情", "修真升级"]},
            {"晋江小说": ["奇幻言情", "灵异神怪"]},
            {"晋江小说": ["奇幻言情", "玄奇幻界"]},
            {"晋江小说": ["奇幻言情", "异术超能"]},
            {"晋江小说": ["奇幻言情", "异闻传说"]},

            # 古装言情+仙侠奇幻
            {"晋江小说": ["奇幻言情", "霸王月票榜"]},
            {"晋江小说": ["奇幻言情", "编辑推荐榜"]},
            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "玄奇幻界"]},
            {"晋江小说": ["奇幻言情", "灵异神怪"]},
            {"晋江小说": ["奇幻言情", "月度排行榜"]},
            {"晋江小说": ["奇幻言情", "最近更新"]},
            {"晋江小说": ["奇幻言情", "新晋作者榜"]},
            {"晋江小说": ["奇幻言情", "异闻传说"]},
            {"晋江小说": ["奇幻言情", "异术超能"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "季度排行榜"]},
            {"晋江小说": ["奇幻言情", "修真升级"]},
            {"晋江小说": ["奇幻言情", "仙侠情缘"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},
            {"晋江小说": ["奇幻言情", "VIP新文榜"]},

            {"晋江小说": ["古代言情", "霸王月票榜"]},
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "编辑推荐榜"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "月度排行榜"]},
            {"晋江小说": ["古代言情", "最近更新"]},
            {"晋江小说": ["古代言情", "新晋作者榜"]},
            {"晋江小说": ["古代言情", "市井人家"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "季度排行榜"]},
            {"晋江小说": ["古代言情", "女尊女强"]},
            {"晋江小说": ["古代言情", "复仇虐渣"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},
            {"晋江小说": ["古代言情", "VIP新文榜"]},

            {"晋江小说": ["古代穿越", "霸王月票榜"]},
            {"晋江小说": ["古代穿越", "编辑推荐榜"]},
            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "月度排行榜"]},
            {"晋江小说": ["古代穿越", "最近更新"]},
            {"晋江小说": ["古代穿越", "新晋作者榜"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},
            {"晋江小说": ["古代穿越", "市井人家"]},
            {"晋江小说": ["古代穿越", "宫廷侯爵"]},
            {"晋江小说": ["古代穿越", "季度排行榜"]},
            {"晋江小说": ["古代穿越", "女尊女强"]},
            {"晋江小说": ["古代穿越", "复仇虐渣"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "VIP新文榜"]},

            # 现实主义

            # 悬疑惊悚+推理探案（等同 悬疑探案）
            {"晋江小说": ["未来游戏悬疑", "悬疑惊悚"]},
            {"晋江小说": ["未来游戏悬疑", "未来科幻"]},
            {"晋江小说": ["未来游戏悬疑", "推理探案"]},
            {"晋江小说": ["未来游戏悬疑", "异度幻想"]},
            {"晋江小说": ["未来游戏悬疑", "末世异世"]},
        ]
    },

    # 项目创投部IP智能推荐群
    {
        "name": "项目创投部IP智能推荐群",
        "target_ai_score": 8.5,
        "matching_list": [
            # 古装言情+仙侠奇幻
            {"晋江小说": ["奇幻言情", "霸王月票榜"]},
            {"晋江小说": ["奇幻言情", "编辑推荐榜"]},
            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "玄奇幻界"]},
            {"晋江小说": ["奇幻言情", "灵异神怪"]},
            {"晋江小说": ["奇幻言情", "月度排行榜"]},
            {"晋江小说": ["奇幻言情", "最近更新"]},
            {"晋江小说": ["奇幻言情", "新晋作者榜"]},
            {"晋江小说": ["奇幻言情", "异闻传说"]},
            {"晋江小说": ["奇幻言情", "异术超能"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "季度排行榜"]},
            {"晋江小说": ["奇幻言情", "修真升级"]},
            {"晋江小说": ["奇幻言情", "仙侠情缘"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},
            {"晋江小说": ["奇幻言情", "VIP新文榜"]},

            {"晋江小说": ["古代言情", "霸王月票榜"]},
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "编辑推荐榜"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "月度排行榜"]},
            {"晋江小说": ["古代言情", "最近更新"]},
            {"晋江小说": ["古代言情", "新晋作者榜"]},
            {"晋江小说": ["古代言情", "市井人家"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "季度排行榜"]},
            {"晋江小说": ["古代言情", "女尊女强"]},
            {"晋江小说": ["古代言情", "复仇虐渣"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},
            {"晋江小说": ["古代言情", "VIP新文榜"]},

            {"晋江小说": ["古代穿越", "霸王月票榜"]},
            {"晋江小说": ["古代穿越", "编辑推荐榜"]},
            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "月度排行榜"]},
            {"晋江小说": ["古代穿越", "最近更新"]},
            {"晋江小说": ["古代穿越", "新晋作者榜"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},
            {"晋江小说": ["古代穿越", "市井人家"]},
            {"晋江小说": ["古代穿越", "宫廷侯爵"]},
            {"晋江小说": ["古代穿越", "季度排行榜"]},
            {"晋江小说": ["古代穿越", "女尊女强"]},
            {"晋江小说": ["古代穿越", "复仇虐渣"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "VIP新文榜"]},

            # 古装大女主
            {"晋江小说": ["古代言情", "复仇虐渣"]},
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "市井人家"]},
            {"晋江小说": ["古代言情", "女尊女强"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},

            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},

            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "仙侠情缘"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},

            # 古装大男主
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},

            {"晋江小说": ["古代穿越", "宫廷侯爵"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},

            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},
            {"晋江小说": ["奇幻言情", "修真升级"]},
            {"晋江小说": ["奇幻言情", "灵异神怪"]},
            {"晋江小说": ["奇幻言情", "玄奇幻界"]},
            {"晋江小说": ["奇幻言情", "异术超能"]},
            {"晋江小说": ["奇幻言情", "异闻传说"]},
        ],
    },

    # IP挖掘团队IP智能推荐群
    {
        "name": "IP挖掘团队IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            {"晋江小说": ["all"]}
        ],
    },

    # 创意资源拓展中心IP智能推荐群
    {
        "name": "创意资源拓展中心IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 古装大女主
            {"晋江小说": ["古代言情", "复仇虐渣"]},
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "市井人家"]},
            {"晋江小说": ["古代言情", "女尊女强"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},

            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},

            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "仙侠情缘"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},

            # 古装大男主
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},

            {"晋江小说": ["古代穿越", "宫廷侯爵"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},

            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},
            {"晋江小说": ["奇幻言情", "修真升级"]},
            {"晋江小说": ["奇幻言情", "灵异神怪"]},
            {"晋江小说": ["奇幻言情", "玄奇幻界"]},
            {"晋江小说": ["奇幻言情", "异术超能"]},
            {"晋江小说": ["奇幻言情", "异闻传说"]},

            # 悬疑探案+现代科幻
            {"晋江小说": ["未来游戏悬疑", "悬疑惊悚"]},
            {"晋江小说": ["未来游戏悬疑", "未来科幻"]},
            {"晋江小说": ["未来游戏悬疑", "推理探案"]},
            {"晋江小说": ["未来游戏悬疑", "异度幻想"]},
            {"晋江小说": ["未来游戏悬疑", "末世异世"]},
        ]
    },

    # 剧芯文化IP智能推荐群
    {
        "name": "剧芯文化IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 都市情感+话题
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "婚前婚后"]},
            {"晋江小说": ["现代言情", "时尚流行"]},

            # 都市大女主
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "都市情缘"]},

            # 都市职场
            {"晋江小说": ["现代言情", "业界精英"]},

            # 古代言情
            {"晋江小说": ["古代言情", "霸王月票榜"]},
            {"晋江小说": ["古代言情", "编辑推荐榜"]},
            {"晋江小说": ["古代言情", "VIP新文榜"]},
            {"晋江小说": ["古代言情", "新晋作者榜"]},
            {"晋江小说": ["古代言情", "月度排行榜"]},
            {"晋江小说": ["古代言情", "季度排行榜"]},
            {"晋江小说": ["古代言情", "最近更新"]},
        ]
    },

    # 剧集中心黄老师团队IP智能推荐群
    {
        "name": "剧集中心黄老师团队IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 现实主义

            # 古装大男主
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "励志人生"]},

            {"晋江小说": ["古代穿越", "宫廷侯爵"]},
        ]
    },

    # 新剧团队IP智能推荐群
    {
        "name": "新剧团队IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 暂无
        ]
    },

    # 蜜橙工作室IP智能推荐群
    {
        "name": "蜜橙工作室IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 现代言情+青春
            {"晋江小说": ["现代言情", "霸王月票榜"]},
            {"晋江小说": ["现代言情", "都市情缘"]},
            {"晋江小说": ["现代言情", "编辑推荐榜"]},
            {"晋江小说": ["现代言情", "月度排行榜"]},
            {"晋江小说": ["现代言情", "最近更新"]},
            {"晋江小说": ["现代言情", "时尚流行"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "新晋作者榜"]},
            {"晋江小说": ["现代言情", "季度排行榜"]},
            {"晋江小说": ["现代言情", "婚前婚后"]},
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "业界精英"]},
            {"晋江小说": ["现代言情", "VIP新文榜"]},

            {"晋江小说": ["幻想现言", "霸王月票榜"]},
            {"晋江小说": ["幻想现言", "编辑推荐榜"]},
            {"晋江小说": ["幻想现言", "VIP新文榜"]},
            {"晋江小说": ["幻想现言", "新晋作者榜"]},
            {"晋江小说": ["幻想现言", "月度排行榜"]},
            {"晋江小说": ["幻想现言", "季度排行榜"]},
            {"晋江小说": ["幻想现言", "最近更新"]},

            # 都市大女主
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "都市情缘"]},

            # 古装言情+仙侠奇幻
            {"晋江小说": ["奇幻言情", "霸王月票榜"]},
            {"晋江小说": ["奇幻言情", "编辑推荐榜"]},
            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "玄奇幻界"]},
            {"晋江小说": ["奇幻言情", "灵异神怪"]},
            {"晋江小说": ["奇幻言情", "月度排行榜"]},
            {"晋江小说": ["奇幻言情", "最近更新"]},
            {"晋江小说": ["奇幻言情", "新晋作者榜"]},
            {"晋江小说": ["奇幻言情", "异闻传说"]},
            {"晋江小说": ["奇幻言情", "异术超能"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "季度排行榜"]},
            {"晋江小说": ["奇幻言情", "修真升级"]},
            {"晋江小说": ["奇幻言情", "仙侠情缘"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},
            {"晋江小说": ["奇幻言情", "VIP新文榜"]},

            {"晋江小说": ["古代言情", "霸王月票榜"]},
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "编辑推荐榜"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "月度排行榜"]},
            {"晋江小说": ["古代言情", "最近更新"]},
            {"晋江小说": ["古代言情", "新晋作者榜"]},
            {"晋江小说": ["古代言情", "市井人家"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "季度排行榜"]},
            {"晋江小说": ["古代言情", "女尊女强"]},
            {"晋江小说": ["古代言情", "复仇虐渣"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},
            {"晋江小说": ["古代言情", "VIP新文榜"]},

            {"晋江小说": ["古代穿越", "霸王月票榜"]},
            {"晋江小说": ["古代穿越", "编辑推荐榜"]},
            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "月度排行榜"]},
            {"晋江小说": ["古代穿越", "最近更新"]},
            {"晋江小说": ["古代穿越", "新晋作者榜"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},
            {"晋江小说": ["古代穿越", "市井人家"]},
            {"晋江小说": ["古代穿越", "宫廷侯爵"]},
            {"晋江小说": ["古代穿越", "季度排行榜"]},
            {"晋江小说": ["古代穿越", "女尊女强"]},
            {"晋江小说": ["古代穿越", "复仇虐渣"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "VIP新文榜"]},
        ]
    },

    # 剧集中心许老师团队IP智能推荐群
    {
        "name": "剧集中心许老师团队IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 都市大女主
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "都市情缘"]},

            # 都市职场
            {"晋江小说": ["现代言情", "业界精英"]},

            # 都市情感+话题
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "婚前婚后"]},
            {"晋江小说": ["现代言情", "时尚流行"]},

            # 古装大男主
            {"晋江小说": ["古代言情", "复仇虐渣"]},
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "市井人家"]},
            {"晋江小说": ["古代言情", "女尊女强"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},

            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},
            {"晋江小说": ["古代穿越", "宫廷侯爵"]},

            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "仙侠情缘"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},

            # 悬疑探案+现代科幻
            {"晋江小说": ["未来游戏悬疑", "悬疑惊悚"]},
            {"晋江小说": ["未来游戏悬疑", "未来科幻"]},
            {"晋江小说": ["未来游戏悬疑", "推理探案"]},
            {"晋江小说": ["未来游戏悬疑", "异度幻想"]},
            {"晋江小说": ["未来游戏悬疑", "末世异世"]},
        ]
    },

    # 剧酷传播项目三部IP智能推荐群
    {
        "name": "剧酷传播项目三部IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 现代言情+青春
            {"晋江小说": ["现代言情", "霸王月票榜"]},
            {"晋江小说": ["现代言情", "都市情缘"]},
            {"晋江小说": ["现代言情", "编辑推荐榜"]},
            {"晋江小说": ["现代言情", "月度排行榜"]},
            {"晋江小说": ["现代言情", "最近更新"]},
            {"晋江小说": ["现代言情", "时尚流行"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "新晋作者榜"]},
            {"晋江小说": ["现代言情", "季度排行榜"]},
            {"晋江小说": ["现代言情", "婚前婚后"]},
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "业界精英"]},
            {"晋江小说": ["现代言情", "VIP新文榜"]},

            {"晋江小说": ["幻想现言", "霸王月票榜"]},
            {"晋江小说": ["幻想现言", "编辑推荐榜"]},
            {"晋江小说": ["幻想现言", "VIP新文榜"]},
            {"晋江小说": ["幻想现言", "新晋作者榜"]},
            {"晋江小说": ["幻想现言", "月度排行榜"]},
            {"晋江小说": ["幻想现言", "季度排行榜"]},
            {"晋江小说": ["幻想现言", "最近更新"]},

            # 都市大女主
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "都市情缘"]},

            # 都市职场
            {"晋江小说": ["现代言情", "业界精英"]},

            # 都市情感+话题
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "婚前婚后"]},
            {"晋江小说": ["现代言情", "时尚流行"]},

            # 古装大女主
            {"晋江小说": ["古代言情", "复仇虐渣"]},
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "市井人家"]},
            {"晋江小说": ["古代言情", "女尊女强"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},

            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},

            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "仙侠情缘"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},
        ]
    },

    # 剧集中心刘老师团队IP智能推荐群
    {
        "name": "剧集中心刘老师团队IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 悬疑探案+现代科幻（悬疑惊悚，推理探案）
            {"晋江小说": ["未来游戏悬疑", "悬疑惊悚"]},
            {"晋江小说": ["未来游戏悬疑", "推理探案"]},
        ]
    },

    # 剧集中心王老师团队IP智能推荐群
    {
        "name": "剧集中心王老师团队IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 都市大女主
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "都市情缘"]},

            # 都市职场
            {"晋江小说": ["现代言情", "业界精英"]},

            # 都市情感+话题
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "婚前婚后"]},
            {"晋江小说": ["现代言情", "时尚流行"]},

            # 现实主义

            # 古装大男主
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},

            {"晋江小说": ["古代穿越", "宫廷侯爵"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},

            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},
            {"晋江小说": ["奇幻言情", "修真升级"]},
            {"晋江小说": ["奇幻言情", "灵异神怪"]},
            {"晋江小说": ["奇幻言情", "玄奇幻界"]},
            {"晋江小说": ["奇幻言情", "异术超能"]},
            {"晋江小说": ["奇幻言情", "异闻传说"]},

            # 古装大女主
            {"晋江小说": ["古代言情", "复仇虐渣"]},
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "市井人家"]},
            {"晋江小说": ["古代言情", "女尊女强"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},

            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},

            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "仙侠情缘"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},

            # 悬疑探案+现代科幻（悬疑惊悚，推理探案）
            {"晋江小说": ["未来游戏悬疑", "悬疑惊悚"]},
            {"晋江小说": ["未来游戏悬疑", "推理探案"]},
        ]
    },

    # 短剧团队IP智能推荐群
    {
        "name": "短剧团队IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 古装大男主
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},

            {"晋江小说": ["古代穿越", "宫廷侯爵"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},

            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},
            {"晋江小说": ["奇幻言情", "修真升级"]},
            {"晋江小说": ["奇幻言情", "灵异神怪"]},
            {"晋江小说": ["奇幻言情", "玄奇幻界"]},
            {"晋江小说": ["奇幻言情", "异术超能"]},
            {"晋江小说": ["奇幻言情", "异闻传说"]},
        ]
    },

    # 好剧影视IP智能推荐群
    {
        "name": "好剧影视IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
        ]
    },

    # 辛迪加影视IP智能推荐群
    {
        "name": "辛迪加影视IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 古装言情+仙侠奇幻
            {"晋江小说": ["奇幻言情", "霸王月票榜"]},
            {"晋江小说": ["奇幻言情", "编辑推荐榜"]},
            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "玄奇幻界"]},
            {"晋江小说": ["奇幻言情", "灵异神怪"]},
            {"晋江小说": ["奇幻言情", "月度排行榜"]},
            {"晋江小说": ["奇幻言情", "最近更新"]},
            {"晋江小说": ["奇幻言情", "新晋作者榜"]},
            {"晋江小说": ["奇幻言情", "异闻传说"]},
            {"晋江小说": ["奇幻言情", "异术超能"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "季度排行榜"]},
            {"晋江小说": ["奇幻言情", "修真升级"]},
            {"晋江小说": ["奇幻言情", "仙侠情缘"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},
            {"晋江小说": ["奇幻言情", "VIP新文榜"]},

            {"晋江小说": ["古代言情", "霸王月票榜"]},
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "编辑推荐榜"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "月度排行榜"]},
            {"晋江小说": ["古代言情", "最近更新"]},
            {"晋江小说": ["古代言情", "新晋作者榜"]},
            {"晋江小说": ["古代言情", "市井人家"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "季度排行榜"]},
            {"晋江小说": ["古代言情", "女尊女强"]},
            {"晋江小说": ["古代言情", "复仇虐渣"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},
            {"晋江小说": ["古代言情", "VIP新文榜"]},

            {"晋江小说": ["古代穿越", "霸王月票榜"]},
            {"晋江小说": ["古代穿越", "编辑推荐榜"]},
            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "月度排行榜"]},
            {"晋江小说": ["古代穿越", "最近更新"]},
            {"晋江小说": ["古代穿越", "新晋作者榜"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},
            {"晋江小说": ["古代穿越", "市井人家"]},
            {"晋江小说": ["古代穿越", "宫廷侯爵"]},
            {"晋江小说": ["古代穿越", "季度排行榜"]},
            {"晋江小说": ["古代穿越", "女尊女强"]},
            {"晋江小说": ["古代穿越", "复仇虐渣"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "VIP新文榜"]},

            # 现实主义

            # 都市大女主
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "都市情缘"]},

            # 都市职场
            {"晋江小说": ["现代言情", "业界精英"]},

            # 古装大女主
            {"晋江小说": ["古代言情", "复仇虐渣"]},
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "市井人家"]},
            {"晋江小说": ["古代言情", "女尊女强"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},

            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},

            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "仙侠情缘"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},

            # 古装大男主
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},

            {"晋江小说": ["古代穿越", "宫廷侯爵"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},

            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},
            {"晋江小说": ["奇幻言情", "修真升级"]},
            {"晋江小说": ["奇幻言情", "灵异神怪"]},
            {"晋江小说": ["奇幻言情", "玄奇幻界"]},
            {"晋江小说": ["奇幻言情", "异术超能"]},
            {"晋江小说": ["奇幻言情", "异闻传说"]},
        ]
    },

    # 梦见森林工作室IP智能推荐群
    {
        "name": "梦见森林工作室IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 古装大女主
            {"晋江小说": ["古代言情", "复仇虐渣"]},
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "市井人家"]},
            {"晋江小说": ["古代言情", "女尊女强"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},

            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},

            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "仙侠情缘"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},

            # 古装言情+仙侠奇幻
            {"晋江小说": ["奇幻言情", "霸王月票榜"]},
            {"晋江小说": ["奇幻言情", "编辑推荐榜"]},
            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "玄奇幻界"]},
            {"晋江小说": ["奇幻言情", "灵异神怪"]},
            {"晋江小说": ["奇幻言情", "月度排行榜"]},
            {"晋江小说": ["奇幻言情", "最近更新"]},
            {"晋江小说": ["奇幻言情", "新晋作者榜"]},
            {"晋江小说": ["奇幻言情", "异闻传说"]},
            {"晋江小说": ["奇幻言情", "异术超能"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "季度排行榜"]},
            {"晋江小说": ["奇幻言情", "修真升级"]},
            {"晋江小说": ["奇幻言情", "仙侠情缘"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},
            {"晋江小说": ["奇幻言情", "VIP新文榜"]},

            {"晋江小说": ["古代言情", "霸王月票榜"]},
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "编辑推荐榜"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "月度排行榜"]},
            {"晋江小说": ["古代言情", "最近更新"]},
            {"晋江小说": ["古代言情", "新晋作者榜"]},
            {"晋江小说": ["古代言情", "市井人家"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "季度排行榜"]},
            {"晋江小说": ["古代言情", "女尊女强"]},
            {"晋江小说": ["古代言情", "复仇虐渣"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},
            {"晋江小说": ["古代言情", "VIP新文榜"]},

            {"晋江小说": ["古代穿越", "霸王月票榜"]},
            {"晋江小说": ["古代穿越", "编辑推荐榜"]},
            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "月度排行榜"]},
            {"晋江小说": ["古代穿越", "最近更新"]},
            {"晋江小说": ["古代穿越", "新晋作者榜"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},
            {"晋江小说": ["古代穿越", "市井人家"]},
            {"晋江小说": ["古代穿越", "宫廷侯爵"]},
            {"晋江小说": ["古代穿越", "季度排行榜"]},
            {"晋江小说": ["古代穿越", "女尊女强"]},
            {"晋江小说": ["古代穿越", "复仇虐渣"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "VIP新文榜"]},

            # 现实主义

            # 家庭情感+话题

            # 都市情感+话题
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "婚前婚后"]},
            {"晋江小说": ["现代言情", "时尚流行"]},

            # 都市职场
            {"晋江小说": ["现代言情", "业界精英"]},
        ]
    },

    # 锦鲤工作室IP智能推荐群
    {
        "name": "锦鲤工作室IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 都市大女主
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "都市情缘"]},

            # 都市职场
            {"晋江小说": ["现代言情", "业界精英"]},

            # 都市情感+话题
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "婚前婚后"]},
            {"晋江小说": ["现代言情", "时尚流行"]},

            # 古装大男主（励志人生）
            {"晋江小说": ["古代言情", "励志人生"]},
        ]
    },

    # 有戏工作室IP智能推荐群
    {
        "name": "有戏工作室IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 悬疑探案+现代科幻
            {"晋江小说": ["未来游戏悬疑", "悬疑惊悚"]},
            {"晋江小说": ["未来游戏悬疑", "未来科幻"]},
            {"晋江小说": ["未来游戏悬疑", "推理探案"]},
            {"晋江小说": ["未来游戏悬疑", "异度幻想"]},
            {"晋江小说": ["未来游戏悬疑", "末世异世"]},

            # 现代言情+青春（幻想现言）
            {"晋江小说": ["幻想现言", "霸王月票榜"]},
            {"晋江小说": ["幻想现言", "编辑推荐榜"]},
            {"晋江小说": ["幻想现言", "VIP新文榜"]},
            {"晋江小说": ["幻想现言", "新晋作者榜"]},
            {"晋江小说": ["幻想现言", "月度排行榜"]},
            {"晋江小说": ["幻想现言", "季度排行榜"]},
            {"晋江小说": ["幻想现言", "最近更新"]},

            # 都市大女主
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "都市情缘"]},

            # 都市职场
            {"晋江小说": ["现代言情", "业界精英"]},

            # 都市情感+话题
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "婚前婚后"]},
            {"晋江小说": ["现代言情", "时尚流行"]},
        ]
    },

    # 新天地工作室IP智能推荐群
    {
        "name": "新天地工作室IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 悬疑探案+现代科幻（推理探案）
            {"晋江小说": ["未来游戏悬疑", "推理探案"]},

            # 古装言情（古代言情）
            {"晋江小说": ["古代言情", "霸王月票榜"]},
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "编辑推荐榜"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "月度排行榜"]},
            {"晋江小说": ["古代言情", "最近更新"]},
            {"晋江小说": ["古代言情", "新晋作者榜"]},
            {"晋江小说": ["古代言情", "市井人家"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "季度排行榜"]},
            {"晋江小说": ["古代言情", "女尊女强"]},
            {"晋江小说": ["古代言情", "复仇虐渣"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},
            {"晋江小说": ["古代言情", "VIP新文榜"]},
        ]
    },

    # 剧可爱IP智能推荐群
    {
        "name": "剧可爱IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 现代言情+青春
            {"晋江小说": ["现代言情", "霸王月票榜"]},
            {"晋江小说": ["现代言情", "都市情缘"]},
            {"晋江小说": ["现代言情", "编辑推荐榜"]},
            {"晋江小说": ["现代言情", "月度排行榜"]},
            {"晋江小说": ["现代言情", "最近更新"]},
            {"晋江小说": ["现代言情", "时尚流行"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "新晋作者榜"]},
            {"晋江小说": ["现代言情", "季度排行榜"]},
            {"晋江小说": ["现代言情", "婚前婚后"]},
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "业界精英"]},
            {"晋江小说": ["现代言情", "VIP新文榜"]},

            {"晋江小说": ["幻想现言", "霸王月票榜"]},
            {"晋江小说": ["幻想现言", "编辑推荐榜"]},
            {"晋江小说": ["幻想现言", "VIP新文榜"]},
            {"晋江小说": ["幻想现言", "新晋作者榜"]},
            {"晋江小说": ["幻想现言", "月度排行榜"]},
            {"晋江小说": ["幻想现言", "季度排行榜"]},
            {"晋江小说": ["幻想现言", "最近更新"]},

            # 都市大女主
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "都市情缘"]},

            # 都市职场
            {"晋江小说": ["现代言情", "业界精英"]},

            # 都市情感+话题
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "婚前婚后"]},
            {"晋江小说": ["现代言情", "时尚流行"]},

            # 古装言情+仙侠奇幻
            {"晋江小说": ["奇幻言情", "霸王月票榜"]},
            {"晋江小说": ["奇幻言情", "编辑推荐榜"]},
            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "玄奇幻界"]},
            {"晋江小说": ["奇幻言情", "灵异神怪"]},
            {"晋江小说": ["奇幻言情", "月度排行榜"]},
            {"晋江小说": ["奇幻言情", "最近更新"]},
            {"晋江小说": ["奇幻言情", "新晋作者榜"]},
            {"晋江小说": ["奇幻言情", "异闻传说"]},
            {"晋江小说": ["奇幻言情", "异术超能"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "季度排行榜"]},
            {"晋江小说": ["奇幻言情", "修真升级"]},
            {"晋江小说": ["奇幻言情", "仙侠情缘"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},
            {"晋江小说": ["奇幻言情", "VIP新文榜"]},

            {"晋江小说": ["古代言情", "霸王月票榜"]},
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "编辑推荐榜"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "月度排行榜"]},
            {"晋江小说": ["古代言情", "最近更新"]},
            {"晋江小说": ["古代言情", "新晋作者榜"]},
            {"晋江小说": ["古代言情", "市井人家"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "季度排行榜"]},
            {"晋江小说": ["古代言情", "女尊女强"]},
            {"晋江小说": ["古代言情", "复仇虐渣"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},
            {"晋江小说": ["古代言情", "VIP新文榜"]},

            {"晋江小说": ["古代穿越", "霸王月票榜"]},
            {"晋江小说": ["古代穿越", "编辑推荐榜"]},
            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "月度排行榜"]},
            {"晋江小说": ["古代穿越", "最近更新"]},
            {"晋江小说": ["古代穿越", "新晋作者榜"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},
            {"晋江小说": ["古代穿越", "市井人家"]},
            {"晋江小说": ["古代穿越", "宫廷侯爵"]},
            {"晋江小说": ["古代穿越", "季度排行榜"]},
            {"晋江小说": ["古代穿越", "女尊女强"]},
            {"晋江小说": ["古代穿越", "复仇虐渣"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "VIP新文榜"]},
        ]
    },

    # 剧酷传播/项目一部IP智能推荐群
    {
        "name": "剧酷传播/项目一部IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 都市职场
            {"晋江小说": ["现代言情", "业界精英"]},

            # 都市情感+话题
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "婚前婚后"]},
            {"晋江小说": ["现代言情", "时尚流行"]},
        ]
    },

    # 羿格工作室IP智能推荐群
    {
        "name": "羿格工作室IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
        ]
    },

    # 李杜团队IP智能推荐群
    {
        "name": "李杜团队IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 都市大女主
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "都市情缘"]},

            # 都市职场
            {"晋江小说": ["现代言情", "业界精英"]},

            # 都市情感+话题
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "婚前婚后"]},
            {"晋江小说": ["现代言情", "时尚流行"]},

            # 家庭情感+话题
        ]
    },

    # 剧酷传播/项目二部IP智能推荐群
    {
        "name": "剧酷传播/项目二部IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 都市大女主
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "都市情缘"]},

            # 都市职场
            {"晋江小说": ["现代言情", "业界精英"]},

            # 都市情感+话题
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "婚前婚后"]},
            {"晋江小说": ["现代言情", "时尚流行"]},
        ]
    },

    # 瞰心晴IP智能推荐群
    {
        "name": "瞰心晴IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 都市大女主
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "都市情缘"]},

            # 都市职场
            {"晋江小说": ["现代言情", "业界精英"]},

            # 都市情感+话题
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "婚前婚后"]},
            {"晋江小说": ["现代言情", "时尚流行"]},

            # 现实主义
        ]
    },

    # 张双双团队IP智能推荐群
    {
        "name": "张双双团队IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 都市大女主
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "都市情缘"]},

            # 都市职场
            {"晋江小说": ["现代言情", "业界精英"]},

            # 都市情感+话题
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "婚前婚后"]},
            {"晋江小说": ["现代言情", "时尚流行"]},

            # 古装言情+仙侠奇幻
            {"晋江小说": ["奇幻言情", "霸王月票榜"]},
            {"晋江小说": ["奇幻言情", "编辑推荐榜"]},
            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "玄奇幻界"]},
            {"晋江小说": ["奇幻言情", "灵异神怪"]},
            {"晋江小说": ["奇幻言情", "月度排行榜"]},
            {"晋江小说": ["奇幻言情", "最近更新"]},
            {"晋江小说": ["奇幻言情", "新晋作者榜"]},
            {"晋江小说": ["奇幻言情", "异闻传说"]},
            {"晋江小说": ["奇幻言情", "异术超能"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "季度排行榜"]},
            {"晋江小说": ["奇幻言情", "修真升级"]},
            {"晋江小说": ["奇幻言情", "仙侠情缘"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},
            {"晋江小说": ["奇幻言情", "VIP新文榜"]},

            {"晋江小说": ["古代言情", "霸王月票榜"]},
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "编辑推荐榜"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "月度排行榜"]},
            {"晋江小说": ["古代言情", "最近更新"]},
            {"晋江小说": ["古代言情", "新晋作者榜"]},
            {"晋江小说": ["古代言情", "市井人家"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "季度排行榜"]},
            {"晋江小说": ["古代言情", "女尊女强"]},
            {"晋江小说": ["古代言情", "复仇虐渣"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},
            {"晋江小说": ["古代言情", "VIP新文榜"]},

            {"晋江小说": ["古代穿越", "霸王月票榜"]},
            {"晋江小说": ["古代穿越", "编辑推荐榜"]},
            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "月度排行榜"]},
            {"晋江小说": ["古代穿越", "最近更新"]},
            {"晋江小说": ["古代穿越", "新晋作者榜"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},
            {"晋江小说": ["古代穿越", "市井人家"]},
            {"晋江小说": ["古代穿越", "宫廷侯爵"]},
            {"晋江小说": ["古代穿越", "季度排行榜"]},
            {"晋江小说": ["古代穿越", "女尊女强"]},
            {"晋江小说": ["古代穿越", "复仇虐渣"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "VIP新文榜"]},
        ]
    },

    # 朱婧团队IP智能推荐群
    {
        "name": "朱婧团队IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 古装言情+仙侠奇幻（古代言情）
            {"晋江小说": ["古代言情", "霸王月票榜"]},
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "编辑推荐榜"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "月度排行榜"]},
            {"晋江小说": ["古代言情", "最近更新"]},
            {"晋江小说": ["古代言情", "新晋作者榜"]},
            {"晋江小说": ["古代言情", "市井人家"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "季度排行榜"]},
            {"晋江小说": ["古代言情", "女尊女强"]},
            {"晋江小说": ["古代言情", "复仇虐渣"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},
            {"晋江小说": ["古代言情", "VIP新文榜"]},

            # 古装大男主（宫廷侯爵，架空历史，励志人生，传奇武侠）
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},

            {"晋江小说": ["古代穿越", "宫廷侯爵"]},

            # 古装大女主（市井人生，女尊女强）
            {"晋江小说": ["古代言情", "市井人家"]},
            {"晋江小说": ["古代言情", "女尊女强"]},
        ]
    },

    # 陈晶晶团队IP智能推荐群
    {
        "name": "陈晶晶团队IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 古装大男主（重生，宫廷侯爵，架空历史，励志人生，传奇武侠，历史穿越）
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},

            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
        ]
    },

    # 曾金韬团队IP智能推荐群
    {
        "name": "曾金韬团队IP智能推荐群",
        "target_ai_score": 8.4,
        "matching_list": [
            # 都市大女主
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "都市情缘"]},

            # 都市职场
            {"晋江小说": ["现代言情", "业界精英"]},

            # 都市情感+话题
            {"晋江小说": ["现代言情", "励志人生"]},
            {"晋江小说": ["现代言情", "时代新风"]},
            {"晋江小说": ["现代言情", "婚前婚后"]},
            {"晋江小说": ["现代言情", "时尚流行"]},

            # 家庭情感+话题

            # 古装言情+仙侠奇幻
            {"晋江小说": ["奇幻言情", "霸王月票榜"]},
            {"晋江小说": ["奇幻言情", "编辑推荐榜"]},
            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "玄奇幻界"]},
            {"晋江小说": ["奇幻言情", "灵异神怪"]},
            {"晋江小说": ["奇幻言情", "月度排行榜"]},
            {"晋江小说": ["奇幻言情", "最近更新"]},
            {"晋江小说": ["奇幻言情", "新晋作者榜"]},
            {"晋江小说": ["奇幻言情", "异闻传说"]},
            {"晋江小说": ["奇幻言情", "异术超能"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "季度排行榜"]},
            {"晋江小说": ["奇幻言情", "修真升级"]},
            {"晋江小说": ["奇幻言情", "仙侠情缘"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},
            {"晋江小说": ["奇幻言情", "VIP新文榜"]},

            {"晋江小说": ["古代言情", "霸王月票榜"]},
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "编辑推荐榜"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "月度排行榜"]},
            {"晋江小说": ["古代言情", "最近更新"]},
            {"晋江小说": ["古代言情", "新晋作者榜"]},
            {"晋江小说": ["古代言情", "市井人家"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "季度排行榜"]},
            {"晋江小说": ["古代言情", "女尊女强"]},
            {"晋江小说": ["古代言情", "复仇虐渣"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},
            {"晋江小说": ["古代言情", "VIP新文榜"]},

            {"晋江小说": ["古代穿越", "霸王月票榜"]},
            {"晋江小说": ["古代穿越", "编辑推荐榜"]},
            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "月度排行榜"]},
            {"晋江小说": ["古代穿越", "最近更新"]},
            {"晋江小说": ["古代穿越", "新晋作者榜"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},
            {"晋江小说": ["古代穿越", "市井人家"]},
            {"晋江小说": ["古代穿越", "宫廷侯爵"]},
            {"晋江小说": ["古代穿越", "季度排行榜"]},
            {"晋江小说": ["古代穿越", "女尊女强"]},
            {"晋江小说": ["古代穿越", "复仇虐渣"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "VIP新文榜"]},

            # 古装大女主
            {"晋江小说": ["古代言情", "复仇虐渣"]},
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "市井人家"]},
            {"晋江小说": ["古代言情", "女尊女强"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},

            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},

            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "仙侠情缘"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},

            # 古装大男主
            {"晋江小说": ["古代言情", "重生"]},
            {"晋江小说": ["古代言情", "宫廷侯爵"]},
            {"晋江小说": ["古代言情", "架空历史"]},
            {"晋江小说": ["古代言情", "励志人生"]},
            {"晋江小说": ["古代言情", "传奇武侠"]},

            {"晋江小说": ["古代穿越", "宫廷侯爵"]},
            {"晋江小说": ["古代穿越", "历史穿越"]},
            {"晋江小说": ["古代穿越", "系统快穿"]},
            {"晋江小说": ["古代穿越", "架空穿越"]},
            {"晋江小说": ["古代穿越", "异世穿书"]},

            {"晋江小说": ["奇幻言情", "系统快穿"]},
            {"晋江小说": ["奇幻言情", "异世穿书"]},
            {"晋江小说": ["奇幻言情", "东方传奇"]},
            {"晋江小说": ["奇幻言情", "修真升级"]},
            {"晋江小说": ["奇幻言情", "灵异神怪"]},
            {"晋江小说": ["奇幻言情", "玄奇幻界"]},
            {"晋江小说": ["奇幻言情", "异术超能"]},
            {"晋江小说": ["奇幻言情", "异闻传说"]},

            # 悬疑探案+现代科幻
            {"晋江小说": ["未来游戏悬疑", "悬疑惊悚"]},
            {"晋江小说": ["未来游戏悬疑", "未来科幻"]},
            {"晋江小说": ["未来游戏悬疑", "推理探案"]},
            {"晋江小说": ["未来游戏悬疑", "异度幻想"]},
            {"晋江小说": ["未来游戏悬疑", "末世异世"]},

        ]
    },

    # 有风共创
    {
        "name": "有风共创",
        "target_ai_score": 8.4,
        "matching_list": [
        ]
    }
]

