# -*- coding: utf-8 -*-
"""Application configuration.

Most configuration is set via environment variables.

For local development, use a .env file to set
environment variables.
"""
import json
import os.path
import logging

from environs import Env
from dotenv import load_dotenv

PROJECT_PATH = os.path.dirname(os.path.dirname(__file__))
# os.environ["APP_ENV"] = os.environ.get("APP_ENV", "DEV")  # Set app environ [DEV, PROD]

dotenv_path = os.path.join(PROJECT_PATH, "config", ".env", os.environ["APP_ENV"].lower())
logging.warning("Project current settings path: %s", dotenv_path)
load_dotenv(dotenv_path)

env = Env()
# env.read_env()

APP_ENV = env.str("APP_ENV", default="DEV")
DEBUG = APP_ENV == "DEV"

WTF_CSRF_ENABLED = False

SECRET_KEY = env.str("SECRET_KEY", default='fr3hhj&6k2b_s&cvk(=(!#wcotx1nkcgkp%0^%no2xg#xr9^n!')
SEND_FILE_MAX_AGE_DEFAULT = env.int("SEND_FILE_MAX_AGE_DEFAULT", default=None)
BCRYPT_LOG_ROUNDS = env.int("BCRYPT_LOG_ROUNDS", default=13)
# DEBUG_TB_ENABLED = DEBUG
DEBUG_TB_ENABLED = False
DEBUG_TB_INTERCEPT_REDIRECTS = False
CACHE_TYPE = (
    "flask_caching.backends.SimpleCache"  # Can be "MemcachedCache", "RedisCache", etc.
)

SQLALCHEMY_DATABASE_URI = env.str("DATABASE_URL")
SQLALCHEMY_TRACK_MODIFICATIONS = True
SQLALCHEMY_BINDS = {
    "workflow": env.str("WORKFLOW_DATABASE_URL"),
    "novel_crawler": env.str("CRAWLER_DATABASE_URL"),
}

TIME_ZONE = None

# OpenAI Config
OPENAI_API_BASE = "http://oneapi.crotondata.cn/v1"
OPENAI_API_KEY = "sk-XpwEM1Np8oLFlEKB755445CcF06c422290F1D0D6A021977b"
OPENAI_MODEL = "gpt-4o"
OPENAI_PROXY = None
CHATGPT_RATE_LIMIT = 30
DALLE_RATE_LIMIT = 20
CONVERSATION_MAX_TOKENS = 100000
TEXT_TO_IMAGE = 'dall-e-3'
SESSION_EXPIRES_IN_SECONDS = 2 * 60 * 60

AZURE_API_VERSION = None
AZURE_DEPLOYMENT_ID = None
IMAGE_CREATE_SIZE = "256x256"

DEFAULT_OPENAI_SYSTEM_PROMPT = "你是基于大语言模型的AI智能助手，旨在回答并解决人们的任何问题，并且可以使用多种语言与人交流。"

# WorkTool Config
MAX_RETRY_TIMES = 3
WT_API_BASE = "https://api.worktool.ymdyes.cn"
WT_ROBOT_ID = env.str("WT_ROBOT_ID")
# WT_GROUP_NAMES = env.list("WT_GROUP_NAMES", subcast=str, delimiter=",")
WT_GROUP_MASTER = "小风机器人"


MIDDLEWARES = [
    "wecom.core.middlewares.authentication.AuthTokenMiddleware"
]

EXEMPT_ENDPOINTS = [
    "wecom/health_check",
]


# 推送相关
PUSH_REBOT_GROUP_MAPPING = [
    # 北京创意发现中心
    {
        "name": "创意发现中心IP智能推荐群",
        "matching_list": [
            # 言情
            {"番茄小说": ["女频排行榜", "职场婚恋", "阅读榜"]},
            {"番茄小说": ["女频排行榜", "职场婚恋", "新书榜"]},

            {"豆瓣小说": ["女性", "连载榜"]},
            {"豆瓣小说": ["女性", "畅销榜", "周榜"]},
            {"豆瓣小说": ["女性", "畅销榜", "月榜"]},
            {"豆瓣小说": ["女性", "完本榜", "月榜"]},
            {"豆瓣小说": ["女性", "推荐票榜", "月榜"]},
            {"豆瓣小说": ["长篇拉力赛", "女性组"]},
            {"豆瓣小说": ["长篇拉力赛", "言情组"]},
            {"豆瓣小说": ["言情", "连载榜"]},
            {"豆瓣小说": ["言情", "畅销榜", "周榜"]},
            {"豆瓣小说": ["言情", "畅销榜", "月榜"]},
            {"豆瓣小说": ["言情", "完本榜", "月榜"]},
            {"豆瓣小说": ["言情", "推荐票榜", "月榜"]},

            {"起点小说": ["女频排行榜", "月票榜", "现言分类榜"]},
            {"起点小说": ["女频排行榜", "阅读指数榜", "现代言情"]},
            {"起点小说": ["女频排行榜", "书友榜", "现代言情"]},
            {"起点小说": ["女频排行榜", "收藏榜", "现代言情"]},
            {"起点小说": ["女频排行榜", "推荐榜", "现代言情"]},

            # 悬疑
            {"番茄小说": ["男频排行榜", "悬疑脑洞", "阅读榜"]},
            {"番茄小说": ["男频排行榜", "悬疑脑洞", "新书榜"]},
            {"番茄小说": ["女频排行榜", "悬疑恋爱", "阅读榜"]},
            {"番茄小说": ["女频排行榜", "悬疑恋爱", "新书榜"]},

            {"起点小说": ["男频排行榜", "书友榜", "悬疑"]},
            {"起点小说": ["男频排行榜", "月票榜", "悬疑"]},
            {"起点小说": ["男频排行榜", "畅销榜", "悬疑"]},
            {"起点小说": ["男频排行榜", "阅读指数榜", "悬疑"]},
            {"起点小说": ["男频排行榜", "推荐榜", "悬疑"]},
            {"起点小说": ["男频排行榜", "收藏榜", "悬疑"]},
            {"起点小说": ["男频排行榜", "更新榜", "悬疑"]},

            {"豆瓣小说": ["悬疑", "连载榜"]},
            {"豆瓣小说": ["悬疑", "畅销榜", "周榜"]},
            {"豆瓣小说": ["悬疑", "畅销榜", "月榜"]},
            {"豆瓣小说": ["悬疑", "完本榜", "月榜"]},
            {"豆瓣小说": ["悬疑", "推荐票榜", "月榜"]},
            {"豆瓣小说": ["长篇拉力赛", "悬疑组"]}
        ]
    },

    # 宽厚团队
    {
        "name": "宽厚IP智能推荐群",
        "matching_list": [
            # 女频
            {"番茄小说": ["女频排行榜", "玄幻言情", "阅读榜"]},
            {"番茄小说": ["女频排行榜", "玄幻言情", "新书榜"]},
            {"番茄小说": ["女频排行榜", "宫斗宅斗", "阅读榜"]},
            {"番茄小说": ["女频排行榜", "宫斗宅斗", "新书榜"]},
            {"番茄小说": ["女频排行榜", "古言脑洞", "阅读榜"]},
            {"番茄小说": ["女频排行榜", "古言脑洞", "新书榜"]},

            {"起点小说": ["女频排行榜", "月票榜", "古言分类榜"]},
            {"起点小说": ["女频排行榜", "月票榜", "幻言分类榜"]},
            {"起点小说": ["女频排行榜", "阅读指数榜", "古代言情"]},
            {"起点小说": ["女频排行榜", "书友榜", "古代言情"]},
            {"起点小说": ["女频排行榜", "收藏榜", "古代言情"]},
            {"起点小说": ["女频排行榜", "推荐榜", "古代言情"]},
            {"起点小说": ["女频排行榜", "阅读指数榜", "仙侠奇缘"]},
            {"起点小说": ["女频排行榜", "书友榜", "仙侠奇缘"]},
            {"起点小说": ["女频排行榜", "收藏榜", "仙侠奇缘"]},
            {"起点小说": ["女频排行榜", "推荐榜", "仙侠奇缘"]},
            {"起点小说": ["女频排行榜", "阅读指数榜", "玄幻言情"]},
            {"起点小说": ["女频排行榜", "书友榜", "玄幻言情"]},
            {"起点小说": ["女频排行榜", "收藏榜", "玄幻言情"]},
            {"起点小说": ["女频排行榜", "推荐榜", "玄幻言情"]},

            # 男频
            {"番茄小说": ["男频排行榜", "奇幻仙侠", "阅读榜"]},
            {"番茄小说": ["男频排行榜", "奇幻仙侠", "新书榜"]},
            {"番茄小说": ["男频排行榜", "历史古代", "阅读榜"]},
            {"番茄小说": ["男频排行榜", "历史古代", "新书榜"]},
            {"番茄小说": ["男频排行榜", "战神赘婿", "阅读榜"]},
            {"番茄小说": ["男频排行榜", "战神赘婿", "新书榜"]},
            {"番茄小说": ["男频排行榜", "传统玄幻", "阅读榜"]},
            {"番茄小说": ["男频排行榜", "传统玄幻", "新书榜"]},
            {"番茄小说": ["男频排行榜", "历史脑洞", "阅读榜"]},
            {"番茄小说": ["男频排行榜", "历史脑洞", "新书榜"]},
            {"番茄小说": ["男频排行榜", "玄幻脑洞", "阅读榜"]},
            {"番茄小说": ["男频排行榜", "玄幻脑洞", "新书榜"]},

            {"起点小说": ["男频排行榜", "书友榜", "玄幻"]},
            {"起点小说": ["男频排行榜", "月票榜", "玄幻"]},
            {"起点小说": ["男频排行榜", "畅销榜", "玄幻"]},
            {"起点小说": ["男频排行榜", "阅读指数榜", "玄幻"]},
            {"起点小说": ["男频排行榜", "推荐榜", "玄幻"]},
            {"起点小说": ["男频排行榜", "收藏榜", "玄幻"]},
            {"起点小说": ["男频排行榜", "更新榜", "玄幻"]},
            {"起点小说": ["男频排行榜", "书友榜", "历史"]},
            {"起点小说": ["男频排行榜", "月票榜", "历史"]},
            {"起点小说": ["男频排行榜", "畅销榜", "历史"]},
            {"起点小说": ["男频排行榜", "阅读指数榜", "历史"]},
            {"起点小说": ["男频排行榜", "推荐榜", "历史"]},
            {"起点小说": ["男频排行榜", "收藏榜", "历史"]},
            {"起点小说": ["男频排行榜", "更新榜", "历史"]},
            {"起点小说": ["男频排行榜", "书友榜", "仙侠"]},
            {"起点小说": ["男频排行榜", "月票榜", "仙侠"]},
            {"起点小说": ["男频排行榜", "畅销榜", "仙侠"]},
            {"起点小说": ["男频排行榜", "阅读指数榜", "仙侠"]},
            {"起点小说": ["男频排行榜", "推荐榜", "仙侠"]},
            {"起点小说": ["男频排行榜", "收藏榜", "仙侠"]},
            {"起点小说": ["男频排行榜", "更新榜", "仙侠"]},

            # 城市大女主
            {"番茄小说": ["女频排行榜", "职场婚恋", "阅读榜"]},
            {"番茄小说": ["女频排行榜", "职场婚恋", "新书榜"]},

            {"豆瓣小说": ["女性", "连载榜"]},
            {"豆瓣小说": ["女性", "畅销榜", "周榜"]},
            {"豆瓣小说": ["女性", "畅销榜", "月榜"]},
            {"豆瓣小说": ["女性", "完本榜", "月榜"]},
            {"豆瓣小说": ["女性", "推荐票榜", "月榜"]},
            {"豆瓣小说": ["长篇拉力赛", "女性组"]},
            {"豆瓣小说": ["长篇拉力赛", "言情组"]},
            {"豆瓣小说": ["言情", "连载榜"]},
            {"豆瓣小说": ["言情", "畅销榜", "周榜"]},
            {"豆瓣小说": ["言情", "畅销榜", "月榜"]},
            {"豆瓣小说": ["言情", "完本榜", "月榜"]},
            {"豆瓣小说": ["言情", "推荐票榜", "月榜"]},

            {"起点小说": ["女频排行榜", "月票榜", "现言分类榜"]},
            {"起点小说": ["女频排行榜", "阅读指数榜", "现代言情"]},
            {"起点小说": ["女频排行榜", "书友榜", "现代言情"]},
            {"起点小说": ["女频排行榜", "收藏榜", "现代言情"]},
            {"起点小说": ["女频排行榜", "推荐榜", "现代言情"]},

            # 悬疑
            {"番茄小说": ["男频排行榜", "悬疑脑洞", "阅读榜"]},
            {"番茄小说": ["男频排行榜", "悬疑脑洞", "新书榜"]},
            {"番茄小说": ["女频排行榜", "悬疑恋爱", "阅读榜"]},
            {"番茄小说": ["女频排行榜", "悬疑恋爱", "新书榜"]},

            {"起点小说": ["男频排行榜", "书友榜", "悬疑"]},
            {"起点小说": ["男频排行榜", "月票榜", "悬疑"]},
            {"起点小说": ["男频排行榜", "畅销榜", "悬疑"]},
            {"起点小说": ["男频排行榜", "阅读指数榜", "悬疑"]},
            {"起点小说": ["男频排行榜", "推荐榜", "悬疑"]},
            {"起点小说": ["男频排行榜", "收藏榜", "悬疑"]},
            {"起点小说": ["男频排行榜", "更新榜", "悬疑"]},

            {"豆瓣小说": ["悬疑", "连载榜"]},
            {"豆瓣小说": ["悬疑", "畅销榜", "周榜"]},
            {"豆瓣小说": ["悬疑", "畅销榜", "月榜"]},
            {"豆瓣小说": ["悬疑", "完本榜", "月榜"]},
            {"豆瓣小说": ["悬疑", "推荐票榜", "月榜"]},
            {"豆瓣小说": ["长篇拉力赛", "悬疑组"]}
        ]
    },

    # 项目创投部
    {
        "name": "项目创投部IP智能推荐群",
        "matching_list": [
            {"番茄小说": ["女频排行榜", "玄幻言情", "阅读榜"]},
            {"番茄小说": ["女频排行榜", "玄幻言情", "新书榜"]},
            {"番茄小说": ["女频排行榜", "宫斗宅斗", "阅读榜"]},
            {"番茄小说": ["女频排行榜", "宫斗宅斗", "新书榜"]},
            {"番茄小说": ["女频排行榜", "古言脑洞", "阅读榜"]},
            {"番茄小说": ["女频排行榜", "古言脑洞", "新书榜"]},

            {"起点小说": ["女频排行榜", "月票榜", "古言分类榜"]},
            {"起点小说": ["女频排行榜", "月票榜", "幻言分类榜"]},
            {"起点小说": ["女频排行榜", "阅读指数榜", "古代言情"]},
            {"起点小说": ["女频排行榜", "书友榜", "古代言情"]},
            {"起点小说": ["女频排行榜", "收藏榜", "古代言情"]},
            {"起点小说": ["女频排行榜", "推荐榜", "古代言情"]},
            {"起点小说": ["女频排行榜", "阅读指数榜", "仙侠奇缘"]},
            {"起点小说": ["女频排行榜", "书友榜", "仙侠奇缘"]},
            {"起点小说": ["女频排行榜", "收藏榜", "仙侠奇缘"]},
            {"起点小说": ["女频排行榜", "推荐榜", "仙侠奇缘"]},
            {"起点小说": ["女频排行榜", "阅读指数榜", "玄幻言情"]},
            {"起点小说": ["女频排行榜", "书友榜", "玄幻言情"]},
            {"起点小说": ["女频排行榜", "收藏榜", "玄幻言情"]},
            {"起点小说": ["女频排行榜", "推荐榜", "玄幻言情"]},
        ],
    }
]



